<template>
  <div style="margin: 1% 2%;">

    <el-card class="box-card" style="padding: 0;">
      <div slot="header" class="clearfix" style="padding: 0;height: 40px">
        <el-form :inline="true" :model="chartSearchForm" ref="chartSearchForm"
                 class="demo-form-inline">
          <el-row :gutter="20">
            <el-col :span="6">
              <el-form-item label="时间" prop="dateTime">
                <div class="block">
                  <el-date-picker
                    v-model="chartSearchForm.dateTime"
                    type="week"
                    :picker-options="pickerOptions"
                    format="yyyy 第 WW 周"
                    placeholder="请选择周">
                  </el-date-picker>
                </div>
              </el-form-item>
            </el-col>
            <el-col :span="7">
              <el-form-item label="机构" prop="officeIds">
                <el-cascader
                  :options="offices"
                  v-model="chartSearchForm.officeIds"
                  :props="props"
                  change-on-select
                  clearable
                  @change="handleChange"
                  placeholder="请选择机构"
                  style="width:120%"></el-cascader>
              </el-form-item>
            </el-col>
            <el-col :span="6">
              <el-form-item label="设备" prop="machineId">
                <el-select v-model="chartSearchForm.machineId"
                           clearable
                           filterable
                           placeholder="请选择设备">
                  <el-option
                    v-for="item in machines"
                    :key="item.value"
                    :label="item.label"
                    :value="item.value">
                  </el-option>
                </el-select>
              </el-form-item>
            </el-col>
            <el-col :span="4" :push="1">
              <el-form-item>
                <el-button icon="el-icon-search" round type="primary" @click="getTimeData">查询</el-button>
              </el-form-item>
            </el-col>
          </el-row>
        </el-form>
      </div>

      <el-tabs v-model="activeName" @tab-click="getTimeData">
        <el-tab-pane name="timeSaleMoney">
          <span slot="label"><svg class="icon"
                                  style="width: 1em; height: 1em;vertical-align: middle;fill: currentColor;overflow: hidden;"
                                  viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2764"><path
            d="M116.419048 615.521524c58.831238-170.593524 51.004952-135.558095 51.004952-135.558095 48.737524-110.83581 186.343619-200.679619 307.590095-200.679619h73.264762c121.173333 0 261.241905 88.868571 308.272762 200.655238 0 0-18.773333-64.853333 50.371048 135.728762 69.168762 200.582095 60.879238 193.974857 60.879238 193.974857 30.841905 117.101714-42.349714 212.041143-163.523048 212.041143H219.014095c-121.173333 0-194.82819-95.232-162.718476-212.065524 0 0 1.29219-23.478857 60.123429-194.072381z m361.008762 171.032381c0 26.916571-0.170667 49.93219 0.048761 72.97219 0.170667 17.408 9.337905 27.672381 26.624 28.086857 17.603048 0.463238 26.282667-10.288762 27.623619-27.233523 0.463238-5.973333 0.24381-11.995429 0.24381-17.993143 0.170667-55.783619 0.170667-55.783619 57.173333-55.808 18.846476 0 38.375619 2.82819 56.32-1.243429 10.410667-2.364952 23.722667-14.628571 26.038857-24.673524 3.657143-15.896381-8.338286-27.306667-25.6-28.281904-17.944381-0.975238-35.986286-0.390095-53.979428-0.414477-19.260952-0.048762-38.546286 0-57.856 0v-34.767238h102.107428c19.139048 0.048762 35.57181-5.680762 36.08381-27.452952 0.585143-23.405714-16.481524-29.598476-36.571429-29.744762-19.260952-0.146286-38.473143-0.024381-60.903619-0.024381 5.851429-11.312762 9.508571-18.870857 13.628953-26.160762 19.285333-34.328381 38.790095-68.510476 58.026666-102.863238 9.362286-16.749714 15.847619-34.523429-5.217523-46.884571-20.943238-12.312381-33.353143 0.853333-42.886096 18.334476-4.900571 9.020952-9.99619 17.92-15.091809 26.843428-24.795429 43.715048-49.590857 87.430095-75.654095 133.290667-4.632381-6.217143-7.460571-9.313524-9.508572-12.897524-28.769524-50.590476-57.368381-101.278476-86.089143-151.893333-9.362286-16.481524-22.77181-24.088381-40.423619-13.750857-16.457143 9.630476-16.700952 24.576-8.338285 40.106666 8.923429 16.579048 18.358857 32.889905 27.501714 49.322667l48.152381 86.552381c-24.624762 0-44.324571 0.097524-64-0.048762-19.821714-0.146286-36.693333 4.705524-39.204572 27.721143-1.999238 18.285714 13.433905 29.330286 39.692191 29.500952 33.206857 0.24381 66.413714 0.073143 100.449524 0.073143v34.742857c-36.327619 0-71.41181-1.536-106.179048 0.902096-11.215238 0.78019-26.112 9.508571-31.597714 19.065904-9.97181 17.383619 5.607619 34.133333 30.232381 34.499048 35.766857 0.487619 71.509333 0.121905 109.153524 0.121905zM287.353905 74.898286c-23.698286-59.245714 5.485714-88.990476 65.877333-67.754667 0 0 88.892952 38.375619 154.965333 38.375619S663.503238 7.070476 663.503238 7.070476c59.904-21.77219 89.234286 8.655238 65.536 67.852191L693.638095 163.449905c-15.018667 37.546667-59.855238 67.925333-100.205714 67.925333h-170.471619c-40.326095 0-85.113905-30.232381-100.181333-67.925333L287.353905 74.898286z"
            fill="#C5CDD4" p-id="2765"></path></svg> 交易金额</span>

          <div class="components-container"
               style='height: 900px;margin-left: -3%'
               v-loading="timeSaleDataLoading"
               element-loading-text="小喵使出了洪荒之力为您加载。。。">
            <div class='chart-container'>
              <timeSaleMoneyChart :data="timeSaleData"
                                  id="chart"
                                  height="900px"
                                  width="100%"
                                  :witch="witch"/>
            </div>
          </div>
        </el-tab-pane>

        <el-tab-pane name="timeSaleCount">
        <span slot="label"><svg class="icon"
                                style="width: 1em; height: 1em;vertical-align: middle;fill: currentColor;overflow: hidden;"
                                viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2806"><path
          d="M785.067 102.4H238.933c-20.48 0-34.133-13.653-34.133-34.133s13.653-34.134 34.133-34.134h546.134c20.48 0 34.133 13.654 34.133 34.134S802.133 102.4 785.067 102.4z m68.266 136.533H170.667c-20.48 0-34.134-13.653-34.134-34.133s13.654-34.133 34.134-34.133h682.666c20.48 0 34.134 13.653 34.134 34.133s-17.067 34.133-34.134 34.133z m0 68.267H170.667c-75.094 0-136.534 61.44-136.534 136.533v409.6c0 75.094 61.44 136.534 136.534 136.534h682.666c75.094 0 136.534-61.44 136.534-136.534v-409.6c0-75.093-61.44-136.533-136.534-136.533zM921.6 853.333c0 37.547-30.72 68.267-68.267 68.267H170.667c-37.547 0-68.267-30.72-68.267-68.267v-409.6c0-37.546 30.72-68.266 68.267-68.266h682.666c37.547 0 68.267 30.72 68.267 68.266v409.6z"
          p-id="2807"></path></svg> 交易笔数</span>

          <div class="components-container"
               style='height: 900px;margin-left: -3%'
               v-loading="timeCountDataLoading"
               element-loading-text="小喵使出了洪荒之力为您加载。。。">
            <div class='chart-container'>
              <timeSaleCountChart :data="timeCountData"
                                  id="countChart"
                                  height="900px"
                                  width="100%"
                                  :witch="witch"/>
            </div>
          </div>
        </el-tab-pane>

        <el-tab-pane name="perBalanceCount">
        <span slot="label"><svg class="icon"
                                style="width: 1em; height: 1em;vertical-align: middle;fill: currentColor;overflow: hidden;"
                                viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2806"><path
          d="M513.678204 1017.327143c-29.768136 0-59.536272-2.697113-89.104622-8.191232-15.383533-2.797006-25.572627-17.581181-22.775621-32.964715 2.797006-15.383533 17.581181-25.572627 32.964715-22.775621 50.446003 9.290056 101.491364 9.589735 151.73758 0.998931 51.844506-8.890484 101.391471-26.97113 147.242392-53.94226 0.099893 0 0.099893-0.099893 0.199786-0.099893 52.843436-30.467388 98.194892-70.224831 134.555971-118.373293 35.162362-46.45028 60.635096-98.694358 75.71895-155.133945 15.083854-56.239801 18.979684-113.977998 11.787383-171.416516-7.491981-59.436379-26.671451-116.075753-56.939052-168.31983-28.669312-49.147393-63.332209-89.803874-105.986552-124.366878-12.186955-9.789521-13.98503-27.670382-4.195509-39.857337 9.789521-12.186955 27.670382-13.98503 39.857337-4.195509 48.048569 38.858406 87.106761 84.709327 119.272331 139.850304 34.163431 58.936914 55.840229 122.768589 64.231247 189.796841 8.091339 64.730712 3.696044 129.761104-13.285779 193.093313-16.981823 63.631888-45.651135 122.369016-85.308686 174.712987-40.956161 54.142046-91.901628 98.994037-151.338008 133.257361-51.744613 30.367495-107.684734 50.845575-166.222076 60.834882C568.819181 1014.929709 541.248692 1017.327143 513.678204 1017.327143zM182.732448 883.969888c-6.892622 0-13.885137-2.497327-19.279363-7.591874-37.160224-34.662897-65.929429-71.723227-87.806012-113.178853-34.063538-58.737128-55.540549-122.369016-63.931568-189.197483-8.091339-64.730712-3.696044-129.761104 13.285779-193.093313 16.981823-63.631888 45.651135-122.369016 85.308686-174.712987 41.056054-54.241939 92.001522-99.09393 151.437901-133.257361 83.51061-48.348248 179.507855-71.323655 277.602854-66.528788 15.58332 0.799145 27.670382 14.084923 26.871237 29.668243-0.799145 15.58332-14.084923 27.670382-29.668243 26.871237-87.206654-4.295402-172.51534 16.182678-246.536108 59.036807C237.07428 152.353011 191.822718 192.210348 155.461639 240.35881c-35.162362 46.45028-60.635096 98.694358-75.71895 155.133945-15.083854 56.239801-18.979684 113.977998-11.787383 171.416516 7.491981 59.436379 26.671451 116.075753 56.939052 168.31983 0.199786 0.299679 0.399572 0.699252 0.599358 0.998931 18.879791 35.961507 43.952953 68.22697 76.617988 98.594464 11.38781 10.688559 12.087062 28.569419 1.398503 40.057123C197.816302 880.973096 190.324322 883.969888 182.732448 883.969888zM513.678204 1022.921155c-30.067815 0-60.335417-2.797006-90.103553-8.291125-8.890484-1.598289-16.682143-6.692836-21.876583-14.084923-5.19444-7.491981-7.092408-16.482357-5.494119-25.372841 1.598289-8.890484 6.692836-16.682143 14.084923-21.77669 7.491981-5.19444 16.482357-7.092408 25.372841-5.494119 49.746751 9.190163 100.192754 9.489842 149.839612 0.998931 51.145254-8.690697 99.992968-26.671451 145.344423-53.243009l0.299679-0.199786c52.144185-30.067815 96.896282-69.325794 132.857789-116.874897 34.662897-45.850921 59.835952-97.395748 74.819913-153.235976 14.884068-55.540549 18.779898-112.579495 11.68749-169.318761-7.392088-58.737128-26.271879-114.577356-56.239801-166.222076-28.369633-48.548034-62.533065-88.70505-104.687942-122.768589-14.584389-11.787383-16.782037-33.264394-4.994654-47.74889 11.787383-14.584389 33.264394-16.782037 47.74889-4.994654 48.647927 39.357871 88.005799 85.608365 120.570941 141.448593 34.563004 59.536272 56.439587 124.067198 64.930498 191.894596 8.191232 65.529857 3.696044 131.159607-13.385672 195.290961-17.181609 64.33114-46.1506 123.767519-86.207723 176.610956-41.455626 54.741405-93.000452 100.092861-153.03619 134.755757-52.343971 30.667174-108.883451 51.444933-168.120044 61.534134C569.518432 1020.523721 541.448478 1022.921155 513.678204 1022.921155zM429.668128 958.689908c-4.595081 0-8.990377 1.398503-12.786314 3.995723-4.994654 3.396365-8.291125 8.590804-9.389949 14.584389-1.098824 5.993584 0.199786 11.987169 3.596151 16.981823 3.396365 4.994654 8.590804 8.291125 14.584389 9.389949 29.068885 5.394226 58.737128 8.091339 88.105692 8.091339 27.170916 0 54.641512-2.297541 81.512749-6.892622 57.83809-9.889414 113.178853-30.167708 164.324107-60.135631 58.837021-33.863752 109.18313-78.216277 149.739719-131.758965 39.158085-51.744613 67.527718-109.882382 84.309755-172.715126 16.782037-62.632958 21.177332-126.964098 13.085993-190.995558-8.291125-66.329001-29.668243-129.361531-63.531995-187.599194-31.865891-54.641512-70.424617-99.893074-117.973721-138.351908-9.689628-7.891553-23.974338-6.393157-31.865891 3.396365-7.891553 9.689628-6.393157 23.974338 3.396365 31.865891 43.153808 34.962576 78.31617 76.118523 107.285162 125.865274 30.767067 52.943329 50.146323 110.281954 57.738197 170.517478 7.292194 58.237662 3.296471 116.575218-11.987169 173.614163-15.28364 57.238732-41.056054 110.082168-76.717881 157.131806-36.860544 48.74782-82.711466 89.104622-136.254154 119.871689l-0.099893 0.099893c-46.45028 27.270809-96.696496 45.651135-149.14036 54.641512-50.945468 8.690697-102.690081 8.391018-153.735442-0.998931C432.365241 958.789801 430.966738 958.689908 429.668128 958.689908zM182.732448 889.663793c-8.590804 0-16.88193-3.196578-23.175193-9.09027-37.659689-35.162362-66.728574-72.622265-88.904836-114.577356-34.363218-59.336486-56.040015-123.667626-64.530926-191.195345-8.191232-65.529857-3.696044-131.159607 13.385672-195.290961 17.181609-64.33114 46.1506-123.767519 86.207723-176.610956C147.270407 147.957716 198.815233 102.60626 258.950864 67.943363c84.409648-48.847713 181.505716-72.1228 280.699539-67.327932 18.680005 0.899038 33.164501 16.88193 32.265463 35.561935-0.899038 18.18054-15.982892 32.265463-33.863752 32.265463-0.599358 0-1.098824 0-1.698182 0-86.10783-4.195509-170.317692 15.982892-243.439422 58.337555C240.570538 156.948092 195.918334 196.206071 159.956827 243.755174c-34.662897 45.850921-59.835952 97.395748-74.819913 153.235976-14.884068 55.540549-18.779898 112.579495-11.68749 169.318761 7.392088 58.737128 26.271879 114.577356 56.239801 166.222076 0.199786 0.399572 0.499465 0.799145 0.699252 1.198717 18.580112 35.362148 43.253701 67.128146 75.419271 97.096068 6.592943 6.193371 10.488773 14.584389 10.788452 23.674659 0.299679 9.09027-2.896899 17.681074-9.09027 24.37391C201.112774 885.66807 192.122397 889.663793 182.732448 889.663793zM513.977883 11.403883c-88.205585 0-174.013736 22.775621-249.433007 66.428895-58.837021 33.863752-109.283023 78.216277-149.839612 131.858858-39.158085 51.744613-67.527718 109.882382-84.309755 172.715126-16.782037 62.632958-21.177332 126.964098-13.085993 190.995558 8.291125 66.129215 29.56835 129.061852 63.232316 187.099728l0.099893 0.199786c21.576904 40.856267 49.946537 77.417133 86.607296 111.680457 4.195509 3.89583 9.689628 6.093478 15.483427 6.093478 6.393157 0 12.186955-2.59722 16.58225-7.192301 4.095616-4.395295 6.293264-10.189094 6.093478-16.282571-0.199786-6.093478-2.797006-11.68749-7.192301-15.783106-33.064608-30.86696-58.537342-63.631888-77.716812-100.092861-0.099893-0.299679-0.299679-0.599358-0.499465-0.799145-30.767067-52.943329-50.146323-110.281954-57.738197-170.417585-7.292194-58.237662-3.296471-116.675111 11.987169-173.614163 15.28364-57.238732 41.056054-110.082168 76.717881-157.131806 36.860544-48.74782 82.711466-89.104622 136.354047-119.871689 75.019699-43.453487 161.327315-64.131354 249.632793-59.835952 12.486634 0.599358 23.0753-9.09027 23.674659-21.477011 0.599358-12.486634-9.09027-23.0753-21.477011-23.674659C530.759919 11.603669 522.368901 11.403883 513.977883 11.403883zM486.007822 413.673294l-97.495641-103.988691c-12.9861-12.9861-10.788452-34.662897 2.197648-47.648997l0 0c12.9861-12.9861 34.662897-10.788452 47.648997 2.197648l97.495641 103.988691c12.9861 12.9861 10.788452 34.662897-2.197648 47.648997l0 0C518.473071 426.759286 498.993922 426.759286 486.007822 413.673294zM510.281839 429.356506c-10.488773 0-20.47808-3.89583-28.26974-11.68749l-0.099893-0.099893-97.395748-103.888797c-14.684282-14.784175-13.685351-39.657551 2.197648-55.640442 14.784175-14.784175 39.757444-13.785244 55.640442 2.197648l0.099893 0.099893 97.395748 103.888797C554.534471 379.010397 553.635433 403.983665 537.652542 419.866664l-0.299679 0.299679-0.399572 0.299679C528.662165 426.459607 519.272216 429.356506 510.281839 429.356506zM490.103438 409.777464c10.488773 10.488773 26.471665 11.088131 39.95723 1.798075 10.988238-11.38781 11.887276-29.268671 1.798075-39.357871l-0.099893-0.099893-97.395748-103.888797c-11.287917-11.287917-29.468457-12.286848-39.557657-2.097755-11.287917 11.287917-12.286848 29.468457-2.197648 39.657551l0.099893 0.099893L490.103438 409.777464zM490.303224 368.221945l103.988691-97.495641c12.9861-12.9861 34.662897-10.788452 47.648997 2.197648l0 0c10.788452 12.9861 10.788452 32.465249-2.197648 45.451349l-103.988691 97.495641c-12.9861 12.9861-34.662897 12.9861-47.648997 0l0 0C475.21937 402.884842 477.317125 381.208045 490.303224 368.221945zM511.980021 431.254475c-10.588666 0-20.47808-4.095616-27.870168-11.38781-7.292194-7.292194-10.988238-17.381395-10.288987-28.169847 0.599358-10.189094 5.19444-20.178401 12.486634-27.470595l0.099893-0.099893 103.888797-97.395748c14.784175-14.684282 39.657551-13.685351 55.640442 2.197648l0.299679 0.399572c13.085993 15.783106 11.987169 38.558727-2.497327 53.143116l-0.099893 0.099893-103.888797 97.395748C532.458102 427.258752 522.568687 431.254475 511.980021 431.254475zM494.298947 372.317561c-5.294333 5.394226-8.690697 12.68642-9.09027 20.078508-0.499465 7.591874 1.997861 14.484496 6.992515 19.47915 5.19444 5.19444 12.286848 8.091339 19.778829 8.091339 7.591874 0 14.584389-2.896899 19.778829-8.091339l0.099893-0.099893 103.888797-97.395748c10.288987-10.288987 11.088131-26.471665 1.897968-37.559796-11.38781-11.188024-29.368564-12.087062-39.457764-1.997861l-0.099893 0.099893L494.298947 372.317561zM802.269296 93.116418 949.611581 121.286265c17.281502 4.295402 30.367495 21.676797 25.972199 38.958299l0 2.197648c-4.295402 17.281502-21.676797 30.367495-38.958299 25.972199L789.283196 160.244564c-17.281502-4.295402-30.367495-21.676797-25.972199-38.958299l0-2.197648C767.606399 101.807115 784.987794 88.721123 802.269296 93.116418zM943.41821 192.60992c-2.497327 0-5.094547-0.299679-7.591874-0.899038L788.484051 163.541035c-9.290056-2.297541-17.681074-8.091339-23.0753-15.982892-5.693905-8.191232-7.591874-17.681074-5.494119-26.671451l0-2.197648 0.099893-0.399572c4.994654-19.978615 24.673589-32.964715 43.053915-28.469526l147.442178 28.169847c9.290056 2.297541 17.681074 8.091339 23.0753 15.982892 5.693905 8.191232 7.591874 17.681074 5.494119 26.671451l0 2.197648-0.099893 0.399572c-2.297541 9.290056-8.091339 17.681074-15.982892 23.0753C956.903775 190.512165 950.210939 192.60992 943.41821 192.60992zM789.982448 156.948092l147.442178 28.169847c7.292194 1.798075 14.884068 0.299679 21.576904-4.395295 6.393157-4.395295 11.188024-11.287917 13.185886-18.779898l0-2.197648 0.099893-0.399572c1.798075-7.292194 0.299679-14.884068-4.395295-21.576904-4.495188-6.49305-11.38781-11.287917-19.079577-13.285779L801.470151 96.412889c-14.684282-3.696044-30.467388 6.892622-34.76279 23.175193l0 2.197648-0.099893 0.399572c-1.798075 7.292194-0.299679 14.884068 4.395295 21.576904C775.497952 150.155363 782.390574 155.050124 789.982448 156.948092zM63.56001 807.951259l147.342285 28.169847c17.281502 4.295402 30.367495 21.676797 25.972199 38.958299l0 2.197648c-4.295402 17.281502-21.676797 30.367495-38.958299 25.972199l-147.342285-28.169847c-17.281502-4.295402-30.367495-21.676797-25.972199-38.958299l0-2.197648C26.699466 816.641956 46.278508 803.655856 63.56001 807.951259zM204.609031 907.544654c-2.497327 0-4.994654-0.299679-7.392088-0.899038L49.774766 878.475769c-19.878722-4.994654-32.864821-24.473803-28.569419-42.654343l0-2.197648c1.098824-9.09027 6.592943-17.581181 14.884068-23.275086 8.590804-5.893691 18.879791-7.991446 28.169847-5.594012l147.442178 28.169847c9.290056 2.297541 17.681074 8.091339 23.0753 15.982892 5.693905 8.191232 7.591874 17.681074 5.494119 26.671451l0 2.197648-0.099893 0.399572C235.875564 895.457592 220.49203 907.544654 204.609031 907.544654zM51.273162 871.782933l147.442178 28.169847c14.684282 3.696044 30.467388-6.892622 34.76279-23.175193l0-2.197648 0.099893-0.399572c1.798075-7.292194 0.299679-14.884068-4.395295-21.576904-4.495188-6.49305-11.38781-11.287917-19.079577-13.285779l-147.442178-28.169847c-7.491981-1.897968-15.783106-0.199786-22.775621 4.595081-6.692836 4.595081-10.988238 11.188024-11.987169 18.280433l0 2.397434-0.099893 0.399572C24.202139 851.704425 34.890698 867.687317 51.273162 871.782933zM672.308406 485.196735 353.849285 485.196735c-17.281502 0-30.367495-12.9861-30.367495-30.367495l0-6.49305c0-17.281502 12.9861-30.367495 30.367495-30.367495l318.459121 0c17.281502 0 30.367495 12.9861 30.367495 30.367495l0 6.49305C702.675901 472.210635 689.689801 485.196735 672.308406 485.196735zM672.308406 490.89064 353.849285 490.89064c-20.47808 0-35.961507-15.483427-35.961507-35.961507l0-6.49305c0-20.47808 15.483427-35.961507 35.961507-35.961507l318.459121 0c20.47808 0 35.961507 15.483427 35.961507 35.961507l0 6.49305C708.269913 475.407214 692.786486 490.89064 672.308406 490.89064zM353.849285 423.662601c-14.28471 0-24.673589 10.38888-24.673589 24.673589l0 6.49305c0 14.28471 10.38888 24.673589 24.673589 24.673589l318.459121 0c14.28471 0 24.673589-10.38888 24.673589-24.673589l0-6.49305c0-14.28471-10.38888-24.673589-24.673589-24.673589L353.849285 423.662601 353.849285 423.662601zM481.71242 719.146315 481.71242 478.703685c0-17.281502 12.9861-30.367495 30.367495-30.367495l6.49305 0c17.281502 0 30.367495 12.9861 30.367495 30.367495l0 242.640278c0 17.281502-12.9861 30.367495-30.367495 30.367495l-8.690697 0C494.69852 749.51381 481.71242 736.52771 481.71242 719.146315zM518.473071 757.30547l-9.489842-0.099893c-18.779898-2.697113-33.064608-19.079577-33.064608-38.059261L475.918622 478.703685c0-20.47808 15.483427-35.961507 35.961507-35.961507l6.49305 0c20.47808 0 35.961507 15.483427 35.961507 35.961507l0 242.640278C554.534471 741.822043 539.051045 757.30547 518.473071 757.30547zM510.281839 746.017552l8.291125 0c14.28471 0 24.673589-10.38888 24.673589-24.673589L543.246554 478.703685c0-14.28471-10.38888-24.673589-24.673589-24.673589l-6.49305 0c-14.28471 0-24.673589 10.38888-24.673589 24.673589l0 240.44263C487.306432 732.432094 497.195846 743.919798 510.281839 746.017552zM672.308406 636.834422 353.849285 636.834422c-17.281502 0-30.367495-12.9861-30.367495-30.367495l0-6.49305c0-17.281502 12.9861-30.367495 30.367495-30.367495l318.459121 0c17.281502 0 30.367495 12.9861 30.367495 30.367495l0 6.49305C702.675901 623.848322 689.689801 636.834422 672.308406 636.834422zM672.308406 642.528327 353.849285 642.528327c-20.47808 0-35.961507-15.483427-35.961507-35.961507l0-6.49305c0-20.47808 15.483427-35.961507 35.961507-35.961507l318.459121 0c20.47808 0 35.961507 15.483427 35.961507 35.961507l0 6.49305C708.269913 627.044901 692.786486 642.528327 672.308406 642.528327zM353.849285 575.400181c-14.28471 0-24.673589 10.38888-24.673589 24.673589l0 6.49305c0 14.28471 10.38888 24.673589 24.673589 24.673589l318.459121 0c14.28471 0 24.673589-10.38888 24.673589-24.673589l0-6.49305c0-14.28471-10.38888-24.673589-24.673589-24.673589L353.849285 575.400181z"
          p-id="1344"></path></svg> 笔单价</span>

          <div class="components-container"
               style='height: 1900px;margin-left: -3%'
               v-loading="perBalanceDataLoading"
               element-loading-text="小喵使出了洪荒之力为您加载。。。">
            <div class='chart-container'>
              <perBalanceChart :data="perBalanceData"
                               id="perBalanceChart"
                               height="900px"
                               width="100%"
                               :witch="witch"/>
            </div>
            <hr style="width: 120%;"/>
            <div class='chart-container' style="margin-left: 12%;">
              <perBalancePieChart :data="perBalancePieData"
                                  id="perBalancePieChart"
                                  height="1000px"
                                  width="108%"
                                  :witch="witch"
                                  style="margin-left: -5%;float: left"/>
              <el-button @click="sectionPriceVisible = true"
                         icon="edit"
                         type="primary"
                         style="float: right;">设置笔单价区间</el-button>
            </div>

          </div>
        </el-tab-pane>
      </el-tabs>
      <el-dialog title="设置笔单价区间"
                 :visible.sync="sectionPriceVisible"
                 :before-close="closeDialog">
        <el-form :inline="true"
                 :model="sectionForm"
                 ref="sectionForm"
                 :rules="sectionFormRules"
                 class="demo-form-inline">
          <el-row :gutter="4" style="margin-left: 27%;">
            <el-form-item label="区间1" prop="sectionOneBegin">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionOneBegin"
                placeholder="请输入单价左闭区间"
                v-on:blur=""/>
            </el-form-item>
            <el-form-item label="-" prop="sectionOneEnd">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionOneEnd"
                placeholder="请输入单价右开区间"
                v-on:blur="checkData(sectionForm.sectionOneEnd, sectionForm.sectionTwoBegin)"/>
            </el-form-item>
          </el-row>

          <el-row :gutter="4" style="margin-left: 27%; margin-top: 10px;">
            <el-form-item label="区间2" prop="sectionTwoBegin">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionTwoBegin"
                placeholder="请输入单价左闭区间"
                v-on:blur=""/>
            </el-form-item>
            <el-form-item label="-" prop="sectionTwoEnd">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionTwoEnd"
                placeholder="请输入单价右开区间"
                v-on:blur="checkData(sectionForm.sectionTwoEnd, sectionForm.sectionThreeBegin)"/>
            </el-form-item>
          </el-row>

          <el-row :gutter="4" style="margin-left: 27%; margin-top: 10px;">
            <el-form-item label="区间3" prop="sectionThreeBegin">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionThreeBegin"
                placeholder="请输入单价左闭区间"
                v-on:blur=""/>
            </el-form-item>
            <el-form-item label="-" prop="sectionThreeEnd">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionThreeEnd"
                placeholder="请输入单价右开区间"
                v-on:blur="checkData(sectionForm.sectionThreeEnd, sectionForm.sectionFourBegin)"/>
            </el-form-item>
          </el-row>

          <el-row :gutter="4" style="margin-left: 27%; margin-top: 10px;">
            <el-form-item label="区间4" prop="sectionFourBegin">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionFourBegin"
                placeholder="请输入单价左闭区间"
                v-on:blur=""/>
            </el-form-item>
            <el-form-item label="-" prop="sectionFourEnd">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionFourEnd"
                placeholder="请输入单价右开区间"
                v-on:blur="checkData(sectionForm.sectionFourEnd, sectionForm.sectionFiveBegin)"/>
            </el-form-item>
          </el-row>

          <el-row :gutter="4" style="margin-left: 27%; margin-top: 10px;">
            <el-form-item label="区间5" prop="sectionFiveBegin">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionFiveBegin"
                placeholder="请输入单价左闭区间"
                v-on:blur=""/>
            </el-form-item>
            <el-form-item label="-" prop="sectionFiveEnd">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionFiveEnd"
                placeholder="请输入单价右开区间"
                v-on:blur="checkData(sectionForm.sectionFiveEnd, sectionForm.sectionSixBegin)"/>
            </el-form-item>
          </el-row>

          <el-row :gutter="4" style="margin-left: 27%; margin-top: 10px;">
            <el-form-item label="区间6" prop="sectionSixBegin">
              <input
                class="el-input__inner"
                onkeyup="this.value=this.value.replace(/[^\d\.]/g,'')"
                onafterpaste="this.value=this.value.replace(/[^\d\.]/g,'')"
                v-model="sectionForm.sectionSixBegin"
                placeholder="请输入单价左闭区间"
                v-on:blur=""/>
            </el-form-item>
            <span style="font-size: 18px">- &nbsp;及以上</span>
          </el-row>
          <el-row style="margin-left: 40%; margin-top: 10px;">
            <el-button @click="sureChange" type="primary" icon="check">确定</el-button>
            <el-button @click="cancel" type="primary" icon="close">取消</el-button>
            <el-button @click="resetForm('sectionForm')" type="primary" icon="delete">重置</el-button>
          </el-row>

        </el-form>
      </el-dialog>
    </el-card>
  </div>
</template>

<script>

  import { fetchPerBalanceCount, fetchTimeCountData, fetchTimeSaleData, getMachineListForSelect } from '../../api/chart';
  import { fetchOfficeTree } from '../../api/office';
  import timeSaleMoneyChart from '@/components/Charts/timeSaleMoneyChart'
  import timeSaleCountChart from '@/components/Charts/timeSaleCountChart'
  import perBalanceChart from '@/components/Charts/perBalanceChart'
  import perBalancePieChart from '@/components/Charts/perBalancePieChart'

  export default {
    components: {
      timeSaleMoneyChart,
      timeSaleCountChart,
      perBalanceChart,
      perBalancePieChart
    },
    created() {
      this.fetchOfficeCasc();
      this.getTimeData();
      this.witch = 1;
    },
    data() {
      return {
        /* 销售时段 */
        timeSaleData: {
          specialChartData: [],
          groups: []
        },
        timeSaleDataLoading: false,
        /* 交易笔数 */
        timeCountData: {
          specialChartData: [],
          groups: []
        },
        timeCountDataLoading: false,
        /* 笔单价 */
        perBalanceData: {
          specialChartData: [],
          groups: []
        },
        sectionForm: {
          sectionOneBegin: 0,
          sectionOneEnd: 2,
          sectionTwoBegin: 2,
          sectionTwoEnd: 4,
          sectionThreeBegin: 4,
          sectionThreeEnd: 6,
          sectionFourBegin: 6,
          sectionFourEnd: 8,
          sectionFiveBegin: 8,
          sectionFiveEnd: 10,
          sectionSixBegin: 10
        },
        perBalancePieData: {
          pieGroup: [],
          funnelData: [],
          perBalance: []
        },
        sectionFormRules: {
          sectionOneBegin: [
            {
              validator: (rule, value, callback) => {
                if (value == '' && value != 0) {
                  callback(new Error('请输入区间1左区间金额'));
                } else {
                  callback();
                }
              }, trigger: 'blur'
            }
          ],
          sectionOneEnd: [
            {
              validator: (rule, value, callback) => {
                if (value != '' && value < this.sectionForm.sectionOneBegin) {
                  callback(new Error('输入区间1右区间金额不应小于区间1左区间'));
                } else if (value == '') {
                  callback(new Error('请输入区间1右区间金额'))
                } else {
                  callback();
                }
              }, trigger: 'blur'
            }
          ],
          sectionTwoBegin: [
            {
              validator: (rule, value, callback) => {
                if (this.sectionForm.sectionOneEnd == '') {
                  callback();
                } else {
                  if (value != '' && value < this.sectionForm.sectionOneEnd) {
                    callback(new Error('输入区间2左区间金额不应小于区间1右区间金额'));
                  } else {
                    callback();
                  }
                }
              }, trigger: 'blur'
            }
          ],
          sectionTwoEnd: [
            {
              validator: (rule, value, callback) => {
                if (this.sectionForm.sectionTwoBegin == '') {
                  if (value != '') {
                    callback(new Error('请输入区间2左区间金额'));
                  } else {
                    callback();
                  }
                } else {
                  if (value != '' && value < this.sectionForm.sectionTwoBegin) {
                    callback(new Error('输入区间2右区间金额不应小于区间2左区间金额'));
                  } else if (value == '') {
                    callback(new Error('请输入区间2右区间金额'));
                  } else {
                    callback();
                  }
                }
              },
              trigger: 'blur'
            }
          ],
          sectionThreeBegin: [
            {
              validator: (rule, value, callback) => {
                if (this.sectionForm.sectionTwoEnd == '') {
                  if (value != '') {
                    callback(new Error('请输入区间2右区间金额'));
                  } else {
                    callback();
                  }
                } else {
                  if (value != '' && value < this.sectionForm.sectionTwoEnd) {
                    callback(new Error('输入区间3左区间金额不应小于区间2右区间金额'));
                  } else {
                    callback();
                  }
                }
              },
              trigger: 'blur'
            }
          ],
          sectionThreeEnd: [
            {
              validator: (rule, value, callback) => {
                if (this.sectionForm.sectionThreeBegin == '') {
                  if (value != '') {
                    callback(new Error('请输入区间3左区间金额'));
                  } else {
                    callback();
                  }
                } else {
                  if (value != '' && value < this.sectionForm.sectionThreeBegin) {
                    callback(new Error('输入区间3右区间金额不应小于区间3左区间金额'));
                  } else if (value == '') {
                    callback(new Error('请输入区间3右区间金额'));
                  } else {
                    callback();
                  }
                }
              },
              trigger: 'blur'
            }
          ],
          sectionFourBegin: [
            {
              validator: (rule, value, callback) => {
                if (this.sectionForm.sectionThreeEnd == '') {
                  if (value != '') {
                    callback(new Error('请输入区间3右区间金额'));
                  } else {
                    callback();
                  }
                } else {
                  if (value != '' && value < this.sectionForm.sectionThreeEnd) {
                    callback(new Error('输入区间4左区间金额不应小于区间3右区间金额'));
                  } else {
                    callback();
                  }
                }
              },
              trigger: 'blur'
            }
          ],
          sectionFourEnd: [
            {
              validator: (rule, value, callback) => {
                if (this.sectionForm.sectionFourBegin == '') {
                  if (value != '') {
                    callback(new Error('请输入区间4左区间金额'));
                  } else {
                    callback();
                  }
                } else {
                  if (value != '' && value < this.sectionForm.sectionFourBegin) {
                    callback(new Error('输入区间4右区间金额不应小于区间4左区间金额'));
                  } else if (value == '') {
                    callback(new Error('请输入区间4右区间金额'));
                  } else {
                    callback();
                  }
                }
              },
              trigger: 'blur'
            }
          ],
          sectionFiveBegin: [
            {
              validator: (rule, value, callback) => {
                if (this.sectionForm.sectionFourEnd == '') {
                  if (value != '') {
                    callback(new Error('请输入区间4右区间金额'));
                  } else {
                    callback();
                  }
                } else {
                  if (value != '' && value < this.sectionForm.sectionFourEnd) {
                    callback(new Error('输入区间5左区间金额不应小于区间4右区间金额'));
                  } else {
                    callback();
                  }
                }
              },
              trigger: 'blur'
            }
          ],
          sectionFiveEnd: [
            {
              validator: (rule, value, callback) => {
                if (this.sectionForm.sectionFiveBegin == '') {
                  if (value != '') {
                    callback(new Error('请输入区间5左区间金额'));
                  } else {
                    callback();
                  }
                } else {
                  if (value != '' && value < this.sectionForm.sectionFiveBegin) {
                    callback(new Error('输入区间5右区间金额不应小于区间5左区间金额'));
                  } else if (value == '') {
                    callback(new Error('请输入区间5右区间金额'));
                  } else {
                    callback();
                  }
                }
              },
              trigger: 'blur'
            }
          ],
          sectionSixBegin: [
            {
              validator: (rule, value, callback) => {
                if (this.sectionForm.sectionFiveEnd == '') {
                  if (value != '') {
                    callback(new Error('请输入区间5右区间金额'));
                  } else {
                    callback();
                  }
                } else {
                  if (value != '' && value < this.sectionForm.sectionFiveEnd) {
                    callback(new Error('输入区间6左区间金额不应小于区间5右区间金额'));
                  } else {
                    callback();
                  }
                }
              },
              trigger: 'blur'
            }
          ]
        },
        sectionPriceVisible: false,
        perBalanceDataLoading: false,
        /* 通用 */
        activeName: 'timeSaleMoney',
        offices: [],
        machines: [],
        chartSearchForm: {
          dateTime: '',
          officeIds: [],
          companyId: null,
          regionId: null,
          officeId: null,
          machineId: '',
          sectionBalance: []
        },
        witch: 0,
        // 设置禁用时间段
        pickerOptions: {
          disabledDate(time) {
            return !(time.getTime() > (new Date('2017/08/02 00:00:00')).getTime() && time.getTime() < Date.now());
          }
        },
        props: {
          children: 'children',
          label: 'name',
          value: 'id'
        }
      }
    },
    methods: {
      /* 销售时段 */
      getTimeSaleData() {
        this.timeSaleDataLoading = true;
        fetchTimeSaleData(this.chartSearchForm).then(response => {
          this.timeSaleDataLoading = false;
          if (response.code === 0) {
            this.timeSaleData = response.response;
          }
        });
      },
      /* 交易笔数 */
      getTimeCountData() {
        this.timeCountDataLoading = true;
        fetchTimeCountData(this.chartSearchForm).then(response => {
          this.timeCountDataLoading = false;
          if (response.code === 0) {
            this.timeCountData = response.response;
          }
        });
      },
      /* 笔单价 */
      getPerBalanceCount() {
        this.perBalanceDataLoading = true;
        this.chartSearchForm.sectionBalance = [];
        this.chartSearchForm.sectionBalance = [
          this.sectionForm.sectionOneBegin,
          this.sectionForm.sectionOneEnd,
          this.sectionForm.sectionTwoBegin,
          this.sectionForm.sectionTwoEnd,
          this.sectionForm.sectionThreeBegin,
          this.sectionForm.sectionThreeEnd,
          this.sectionForm.sectionFourBegin,
          this.sectionForm.sectionFourEnd,
          this.sectionForm.sectionFiveBegin,
          this.sectionForm.sectionFiveEnd,
          this.sectionForm.sectionSixBegin
        ];
        fetchPerBalanceCount(this.chartSearchForm).then(response => {
          this.perBalanceDataLoading = false;
          if (response.code === 0) {
            this.perBalanceData = response.response;
            this.perBalancePieData = response.response;
          }
        });
      },
      checkData(first, second) {
        if (first) {
          second = first;
        }
      },
      sureChange() {
        this.$refs.sectionForm.validate(valid => {
          if (valid) {
            this.sectionPriceVisible = false;
            this.getPerBalanceCount();
          }
        })
      },
      cancel() {
        this.resetForm('sectionForm');
        this.sectionPriceVisible = false;
      },
      closeDialog(done) {
        done();
        this.resetForm('sectionForm');
      },
      /* 通用 */
      resetForm(formName) {
        this.$refs[formName].resetFields();
      },
      getTimeData() {
        switch (this.activeName) {
          case 'timeSaleMoney':
            this.getTimeSaleData();
            this.witch = 1;
            break;
          case 'timeSaleCount':
            this.getTimeCountData();
            this.witch = 2;
            break;
          case 'perBalanceCount':
            this.getPerBalanceCount();
            this.witch = 3;
            break;
          default:
            break;
        }
      },
      // 初始化机构
      fetchOfficeCasc() {
        fetchOfficeTree().then(response => {
          if (response.code === 0 && response.response) {
            this.offices = response.response[0].children;
          }
        });
      },
      handleChange(value) {
        let cId = null;
        let rId = null;
        let oId = null;
        if (value) {
          if (value[0]) {
            this.chartSearchForm.companyId = value[0]
            cId = value[0];
          } else {
            this.chartSearchForm.companyId = null
          }
          if (value[1]) {
            this.chartSearchForm.regionId = value[1]
            rId = value[1]
          } else {
            this.chartSearchForm.regionId = null
          }
          if (value[2]) {
            this.chartSearchForm.officeId = value[2]
            oId = value[2]
          } else {
            this.chartSearchForm.officeId = null
          }
        }
        this.chartSearchForm.machineId = '';
        if (value.length > 0) {
          getMachineListForSelect(cId, rId, oId).then(response => {
            if (response.code === 0) {
              this.machines = response.response
            }
          })
        } else {
          this.machines = [];
        }
      }
    }
  }
</script>
